:PROPERTIES:
:ID:       53b915d9-5347-4878-832c-713a45b5be75
:END:
#+auto_tangle: yes
#+PROPERTY: header-args       :tangle-mode (identity #o444)
#+PROPERTY: header-args:shell :tangle-mode (identity #o755)
#+title: system configuration

[[id:2e1b78ef-de6f-4af9-8a89-5d5ffe12a3ba][My]] system configurations for [[id:959414da-620e-473b-80fc-1918fb459c02][GNU Guix]], compiled by [[id:953e0494-76b3-4ab7-bfe6-944e178b59dd][GNU Emacs]], deployed by [[id:884406e4-0851-4dc3-a6d3-cfe1c9fa1b2b][GNU
Stow]].

involves some [[id:f43fa203-367c-44a9-9762-e623f4ae41d1][system administration]], [[id:5f896cd4-d7b8-44d2-a40d-ccdae1b80c33][programming]], and rice.

inspired by [[https://config.daviwil.com/systems][System Configuration with Guix - config.daviwil.com]]

**** tree
#+begin_src shell :results drawer
tree $HOME/dotfiles/.config/guix
#+end_src

#+RESULTS:
:results:
/home/samuel//dotfiles/.config/guix
├── channels.scm
├── current -> /var/guix/profiles/per-user/samuel/current-guix
└── qzdl
    ├── device
    │   ├── donutrust.scm
    │   └── xps.scm
    ├── packages
    │   ├── go-mvdan-sh.scm
    │   └── python-3.6.4.scm
    ├── qzdl.scm
    ├── rules.scm
    ├── services.scm
    └── system
        ├── base.scm
        ├── install.scm
        └── minimal.scm

5 directories, 11 files
:end:

*** functions
#+begin_src shell :tangle .config/shell/functions :results drawer
qz-color() {
    echo -e "$1$2${qz_reset}"
}

qz-number-lines() {
    awk '{print NR" "$0}';
}

qz-reverse() {
    qz-number-lines | sort -k1 -n -r | sed 's/^[^ ]* //g';
}

# guix reconfigure, and debug to the repl
qz-guix-reconfigure-debug()  {
    sudo -E guix repl -L "$HOME/.config/guix";
}

qz-guix-reconfigure()  {
    sudo -E guix system \
        -L "$HOME/.config/guix" \
        reconfigure "$HOME/.config/guix/qzdl/device/$(hostname).scm";
}

# guix profile commands; make it easy to switch and check
qz-guix-source-extra-profile() {
    qz-guix-source-profile "$GUIX_EXTRA_PROFILES/$@";
}
qz-guix-source-profile() {
    export GUIX_PROFILE="$@"
    . "$GUIX_PROFILE/etc/profile";
}

qz-download-scihub-doi() {
    curl -O \
        $(curl -s http://sci-hub.tw/"$@" \
          | grep location.href \
          | grep -o http.*pdf);
}

qz-get-functions() {
  FILE="$QZ_FUNCTIONS"
  cat $FILE \
    | grep -on '^qz-.*()' \
    | awk -F: '{print file":"$1,$2}' file=$FILE
}

qz-get-aliases() {
  FILE="$QZ_ALIASES"
  cat $FILE \
    | grep -on "\s.*='.*'" \
    | awk -F: '{print file":"$1,$2}' file=$FILE
}
#+end_src

#+RESULTS:
:results:
/home/samuel//.config/shell/aliasrc:3   ls='ls -p --color=auto'
/home/samuel//.config/shell/aliasrc:4   ll='ls -lah'
/home/samuel//.config/shell/aliasrc:5   grep='grep --color=auto'
/home/samuel//.config/shell/aliasrc:10   g='guix'
/home/samuel//.config/shell/aliasrc:11   gp='echo $GUIX_PROFILE'
/home/samuel//.config/shell/aliasrc:12   gg='git'
/home/samuel//.config/shell/aliasrc:13   h='sudo herd'
/home/samuel//.config/shell/aliasrc:14   xo='xdg-open'
/home/samuel//.config/shell/aliasrc:18   rrb='source ~/.bashrc'
/home/samuel//.config/shell/aliasrc:19   rrp='source ~/.profile'
/home/samuel//.config/shell/aliasrc:20   rra='source $HOME/.config/shell/aliasrc'
/home/samuel//.config/shell/aliasrc:24   aa='cat '
/home/samuel//.config/shell/aliasrc:28   gse='qz/guix-source-extra-profile'
/home/samuel//.config/shell/aliasrc:29   gsp='qz/guix-source-profile'
/home/samuel//.config/shell/aliasrc:30   dlsh='qz/download-scihub-doi'
:end:
***** clippy
#+begin_src bash :tangle .local/bin/clippy :tangle-mode (identity #o755)
echo "
░░░░░░▄████▄
░░░░░▐▌░░░░▐▌
░░▄▀▀█▀░░░░▐▌
░░▄░▐▄░░░░░▐▌▀▀▄
▐▀░▄▄░▀▌░▄▀▀░▀▄░▀
▐░▀██▀░▌▐░▄██▄░▌
░▀▄░▄▄▀░▐░░▀▀░░▌
░░░░█░░░░▀▄▄░▄▀
░░░░█░█░░░░█░▐
░░░░█░█░░░▐▌░█
░░░░█░█░░░▐▌░█
░░░░▐▌▐▌░░░█░█
░░░░▐▌░█▄░▐▌░█
░░░░░█░░▀▀▀░░▐▌
░░░░░▐▌░░░░░░█
░░░░░░█▄░░░░▄█
░░░░░░░▀████▀"
#+end_src

#+RESULTS:
|                   |
| ░░░░░░▄████▄      |
| ░░░░░▐▌░░░░▐▌     |
| ░░▄▀▀█▀░░░░▐▌     |
| ░░▄░▐▄░░░░░▐▌▀▀▄  |
| ▐▀░▄▄░▀▌░▄▀▀░▀▄░▀ |
| ▐░▀██▀░▌▐░▄██▄░▌  |
| ░▀▄░▄▄▀░▐░░▀▀░░▌  |
| ░░░░█░░░░▀▄▄░▄▀   |
| ░░░░█░█░░░░█░▐    |
| ░░░░█░█░░░▐▌░█    |
| ░░░░█░█░░░▐▌░█    |
| ░░░░▐▌▐▌░░░█░█    |
| ░░░░▐▌░█▄░▐▌░█    |
| ░░░░░█░░▀▀▀░░▐▌   |
| ░░░░░▐▌░░░░░░█    |
| ░░░░░░█▄░░░░▄█    |
| ░░░░░░░▀████▀     |
*** testing :test:
#+begin_src shell :tangle .local/bin/test-system.sh
headline "TESTING SHELL CONFIGS"
delim

block "BEGIN: linting"
echo "...TODO lint shell files @shfmt"
block "END: linting"
delim

block "BEGIN: sourcing"
tmpbase="$HOME/.config/shell"
for f in $(find "$tmpbase/") ; do
    [ -d $f ] && continue;
    echo "...sourcing $f"

    if $(source "$f"); then
        qz-color $qz_greener ".....PASSED: $f"
    else qz-color $qz_red ".....FAILED: $f"
    fi;
done;

block "END: sourcing"
#+end_src

#+RESULTS:
***

